<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>
<body>
<?php
$students = [
    ["นางสาวกฤติมา", "เกียรติอาภรณ์"],
    ["นายจุฬาลักษณ์", "คงจรูญ"],
    ["นายไตรคูน", "บุญนำ"],
    ["นายวรนาศักดิ์", "เกียรติพิเชฐชื่น"],
    ["นายนนทวัฒน์", "ขำดวง"],
    ["นายภานุพงศ์", "สายศร"],
    ["นายปัณณกร", "พวงสุวรรณ"],
    ["นายวิศรุต", "กลิ่นเรือง"],
    ["นายอมรเทพ", "อันโน"],
    ["นายจักรกริช", "เทศทอง"],
    ["นายจิรฐา", "น้อยศรี"],
    ["นายกรพิพัฒน์", "เล็กนาก"],
    ["นายภัทรพล", "ชมพุฒ"],
    ["นายศุภชัย", "รุ่งแสง"],
    ["นายณัฐพล", "ปลื้มกิจมงคล"],
    ["นายพลัษฎฐ์", "ด้านอนันต์สุข"],
    ["นายเรืองวิทย์", "โชคชัย"],
    ["นายจิรายุธ", "บูรณะจันทร์"],
    ["นางสาวณัชชา", "คำภา"],
    ["นางสาวสาวิตรี", "มินสะมัน"],
    ["นางสาวบัณพร", "ศิริพันธ์"],
    ["นางสาวญาณิศา", "พ่วงพี"],
    ["นางสาวกิตญาดา", "จิตรวิมลรัตน์"],
    ["นางสาวสุดารัตน์", "สวนยิ้ม"],
    ["นางสาวพลอยประภัส", "พิษรักษ์"],
    ["นางสาวทัศชนก", "สมัย"],
    ["นางสาวแพรพิไล", "บุญครอง"],
    ["นางสาวกัลยภรณ์", "สิทธิวงศ์"],
    ["นางสาวกาญจน์เกล้า", "สิทโธ"],
    ["นางสาวอภิษฎา", "วชิระศรีสุนทรา"],
    ["นางสาวศิริกานต์", "เบ้าตุ๋น"],
    ["นางสาวกัญญาวีย์", "อุดมสารี"],
    ["นางสาวณัฐริณีย์", "ฉิมเรือง"],
    ["นางสาวพิชญาภรณ์", "มีโชคสม"],
    ["นางสาวกัลย์ณิศา", "รัตน์เรืองอุดม"],
    ["นางสาวชุดา", "สาริพันธ์"],
    ["นางสาวกันตา", "ปิยะภัทรกุล"],
    ["นางสาวนภัสพรพรหม", "ตันชรากรณ์"],
    ["นางสาวกิ่งกาญจน์", "รวมพล"],
    ["นางสาววชิราญาณ์", "วชิระนาวิน"]
];
echo "<h2>1. ให้นักเรียนเขียนคำสั่งภาษา PHP ชื่อนักเรียนลงในตารางตามรูปแบบ</h2>";
echo "<p><i>**สามารถเปิดหาข้อมูลจาก internet ได้ สามารถใช้ Framework ในการสร้าง table ได้</i></p>";
echo "<table border='1' cellpadding='8' cellspacing='0'>";
echo "<tr><th>No.</th><th>ชื่อ</th><th>นามสกุล</th><th>ห้อง</th></tr>";
foreach ($students as $index => $student) {
    $no = $index + 1;
    echo "<tr>";
    echo "<td>$no</td>";
    echo "<td>{$student[0]}</td>";
    echo "<td>{$student[1]}</td>";
    echo "<td>6/9</td>";
    echo "</tr>";
}

echo "</table>";
?>

</body>
</html>